7767517
30 30
Input                    input                    0 1 input
Convolution              Conv_0                   1 1 input 167 0=16 1=3 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     Conv_2                   1 1 167 170 0=16 1=3 4=1 5=1 6=144 7=16 9=1
Convolution              Conv_4                   1 1 170 173 0=32 1=1 5=1 6=512 9=1
ConvolutionDepthWise     Conv_6                   1 1 173 176 0=32 1=3 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              Conv_8                   1 1 176 179 0=64 1=1 5=1 6=2048 9=1
ConvolutionDepthWise     Conv_10                  1 1 179 182 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_12                  1 1 182 185 0=64 1=1 5=1 6=4096 9=1
ConvolutionDepthWise     Conv_14                  1 1 185 188 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              Conv_16                  1 1 188 191 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     Conv_18                  1 1 191 194 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_20                  1 1 194 197 0=128 1=1 5=1 6=16384 9=1
ConvolutionDepthWise     Conv_22                  1 1 197 200 0=128 1=3 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              Conv_24                  1 1 200 203 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     Conv_26                  1 1 203 206 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_28                  1 1 206 209 0=256 1=1 5=1 6=65536 9=1
ConvolutionDepthWise     Conv_30                  1 1 209 212 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_32                  1 1 212 215 0=256 1=1 5=1 6=65536 9=1
ConvolutionDepthWise     Conv_34                  1 1 215 218 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_36                  1 1 218 221 0=256 1=1 5=1 6=65536 9=1
ConvolutionDepthWise     Conv_38                  1 1 221 224 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_40                  1 1 224 227 0=256 1=1 5=1 6=65536 9=1
ConvolutionDepthWise     Conv_42                  1 1 227 230 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_44                  1 1 230 233 0=256 1=1 5=1 6=65536 9=1
ConvolutionDepthWise     Conv_46                  1 1 233 236 0=256 1=3 3=2 4=1 5=1 6=2304 7=256 9=1
Convolution              Conv_48                  1 1 236 239 0=512 1=1 5=1 6=131072 9=1
ConvolutionDepthWise     Conv_50                  1 1 239 242 0=512 1=3 4=1 5=1 6=4608 7=512 9=1
Convolution              Conv_52                  1 1 242 245 0=512 1=1 5=1 6=262144 9=1
Pooling                  GlobalAveragePool_54     1 1 245 252 0=1 4=1
InnerProduct             Gemm_56                  1 1 252 output 0=62 1=1 2=31744
